#수치 연산자

#사칙연산
print(8*3)
print(8+3)
print(8-3)
print(8/3)

print("=========="*50)

#나누기는 실수로 표현된다(정수->실수)
print(8/3)
print(8.0 / 3)
print(8/3.0)
print(8.0/3.0)
print(type(8/2))

print("==============================================================")
print(8//3) #몫
print(7%3) #나머지
print(8**2) #8제곱
print(divmod(14,3)) #몫, 나머지

print("==============================================================")
#연산자 우선순위
print(2+3*4) #14
print(-2+3*4) #10
print(-(2+3)*4) #-20
print((-2+3)*4) #4
print(4/2*2) #4.0
print(4/(2*2)) #1.0
print("==============================================================")
print(2**3) #8
print(2**3**2) #512
